###################################################################
# Created by write_sdc on Tue Feb 13 08:18:12 2007
#
# These are the original constraints on the exceptions design
###################################################################
set sdc_version 1.6

set_wire_load_mode top
set_wire_load_model -name 16000 -library cb13fs120_tsmc_max
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
set_input_delay -clock clk  2  [get_ports reset_l]
set_input_delay -clock clk  2  [get_ports {adr_i[15]}]
set_input_delay -clock clk  2  [get_ports {adr_i[14]}]
set_input_delay -clock clk  2  [get_ports {adr_i[13]}]
set_input_delay -clock clk  2  [get_ports {adr_i[12]}]
set_input_delay -clock clk  2  [get_ports {adr_i[11]}]
set_input_delay -clock clk  2  [get_ports {adr_i[10]}]
set_input_delay -clock clk  2  [get_ports {adr_i[9]}]
set_input_delay -clock clk  2  [get_ports {adr_i[8]}]
set_input_delay -clock clk  2  [get_ports {adr_i[7]}]
set_input_delay -clock clk  2  [get_ports {adr_i[6]}]
set_input_delay -clock clk  2  [get_ports {adr_i[5]}]
set_input_delay -clock clk  2  [get_ports {adr_i[4]}]
set_input_delay -clock clk  2  [get_ports {adr_i[3]}]
set_input_delay -clock clk  2  [get_ports {adr_i[2]}]
set_input_delay -clock clk  2  [get_ports {adr_i[1]}]
set_input_delay -clock clk  2  [get_ports {adr_i[0]}]
set_input_delay -clock clk  2  [get_ports {coeff[15]}]
set_input_delay -clock clk  2  [get_ports {coeff[14]}]
set_input_delay -clock clk  2  [get_ports {coeff[13]}]
set_input_delay -clock clk  2  [get_ports {coeff[12]}]
set_input_delay -clock clk  2  [get_ports {coeff[11]}]
set_input_delay -clock clk  2  [get_ports {coeff[10]}]
set_input_delay -clock clk  2  [get_ports {coeff[9]}]
set_input_delay -clock clk  2  [get_ports {coeff[8]}]
set_input_delay -clock clk  2  [get_ports {coeff[7]}]
set_input_delay -clock clk  2  [get_ports {coeff[6]}]
set_input_delay -clock clk  2  [get_ports {coeff[5]}]
set_input_delay -clock clk  2  [get_ports {coeff[4]}]
set_input_delay -clock clk  2  [get_ports {coeff[3]}]
set_input_delay -clock clk  2  [get_ports {coeff[2]}]
set_input_delay -clock clk  2  [get_ports {coeff[1]}]
set_input_delay -clock clk  2  [get_ports {coeff[0]}]
set_input_delay -clock clk  0.35  [get_ports sel_combo]
set_output_delay -clock clk  4  [get_ports {dout[31]}]
set_output_delay -clock clk  4  [get_ports {dout[30]}]
set_output_delay -clock clk  4  [get_ports {dout[29]}]
set_output_delay -clock clk  4  [get_ports {dout[28]}]
set_output_delay -clock clk  4  [get_ports {dout[27]}]
set_output_delay -clock clk  4  [get_ports {dout[26]}]
set_output_delay -clock clk  4  [get_ports {dout[25]}]
set_output_delay -clock clk  4  [get_ports {dout[24]}]
set_output_delay -clock clk  4  [get_ports {dout[23]}]
set_output_delay -clock clk  4  [get_ports {dout[22]}]
set_output_delay -clock clk  4  [get_ports {dout[21]}]
set_output_delay -clock clk  4  [get_ports {dout[20]}]
set_output_delay -clock clk  4  [get_ports {dout[19]}]
set_output_delay -clock clk  4  [get_ports {dout[18]}]
set_output_delay -clock clk  4  [get_ports {dout[17]}]
set_output_delay -clock clk  4  [get_ports {dout[16]}]
set_output_delay -clock clk  4  [get_ports {dout[15]}]
set_output_delay -clock clk  4  [get_ports {dout[14]}]
set_output_delay -clock clk  4  [get_ports {dout[13]}]
set_output_delay -clock clk  4  [get_ports {dout[12]}]
set_output_delay -clock clk  4  [get_ports {dout[11]}]
set_output_delay -clock clk  4  [get_ports {dout[10]}]
set_output_delay -clock clk  4  [get_ports {dout[9]}]
set_output_delay -clock clk  4  [get_ports {dout[8]}]
set_output_delay -clock clk  4  [get_ports {dout[7]}]
set_output_delay -clock clk  4  [get_ports {dout[6]}]
set_output_delay -clock clk  4  [get_ports {dout[5]}]
set_output_delay -clock clk  4  [get_ports {dout[4]}]
set_output_delay -clock clk  4  [get_ports {dout[3]}]
set_output_delay -clock clk  4  [get_ports {dout[2]}]
set_output_delay -clock clk  4  [get_ports {dout[1]}]
set_output_delay -clock clk  4  [get_ports {dout[0]}]
