reset_design

create_clock -p 1.0 [get_ports Clk]
set all_in_ex_clk [remove_from_collection [all_inputs] [get_ports Clk]]
set_input_delay .1 -max -clock Clk -clock_fall $all_in_ex_clk
set_output_delay -max .10 -clock Clk -clock_fall [all_outputs]
# set_load 0.03 [all_outputs]
set_load 0.03 [all_outputs]
