###################################################################

# Created by write_sdc on Thu Mar 26 16:02:55 2009

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_leakage_power 0
group_path -name FEEDTHROUGH  -from [list [get_ports sys_clk] [get_ports sys_2x_clk] [get_ports sdram_clk] [get_ports scan_en] [get_ports test_mode] [get_ports pci_rst_n] [get_ports sdram_rst_n] [get_ports sys_rst_n] [get_ports sys_2x_rst_n] [get_ports pclk] [get_ports pidsel] [get_ports pgnt_n] [get_ports {pad_in[15]}] [get_ports {pad_in[14]}] [get_ports {pad_in[13]}] [get_ports {pad_in[12]}] [get_ports {pad_in[11]}] [get_ports {pad_in[10]}] [get_ports {pad_in[9]}] [get_ports {pad_in[8]}] [get_ports {pad_in[7]}] [get_ports {pad_in[6]}] [get_ports {pad_in[5]}] [get_ports {pad_in[4]}] [get_ports {pad_in[3]}] [get_ports {pad_in[2]}] [get_ports {pad_in[1]}] [get_ports {pad_in[0]}] [get_ports ppar_in] [get_ports {pc_be_in[3]}] [get_ports {pc_be_in[2]}] [get_ports {pc_be_in[1]}] [get_ports {pc_be_in[0]}] [get_ports pframe_n_in] [get_ports ptrdy_n_in] [get_ports pirdy_n_in] [get_ports pdevsel_n_in] [get_ports pstop_n_in] [get_ports pperr_n_in] [get_ports pserr_n_in] [get_ports pm66en] [get_ports {sd_DQ_in[15]}] [get_ports {sd_DQ_in[14]}] [get_ports {sd_DQ_in[13]}] [get_ports {sd_DQ_in[12]}] [get_ports {sd_DQ_in[11]}] [get_ports {sd_DQ_in[10]}] [get_ports {sd_DQ_in[9]}] [get_ports {sd_DQ_in[8]}] [get_ports {sd_DQ_in[7]}] [get_ports {sd_DQ_in[6]}] [get_ports {sd_DQ_in[5]}] [get_ports {sd_DQ_in[4]}] [get_ports {sd_DQ_in[3]}] [get_ports {sd_DQ_in[2]}] [get_ports {sd_DQ_in[1]}] [get_ports {sd_DQ_in[0]}]]  -to [list [get_ports {pad_out[15]}] [get_ports {pad_out[14]}] [get_ports {pad_out[13]}] [get_ports {pad_out[12]}] [get_ports {pad_out[11]}] [get_ports {pad_out[10]}] [get_ports {pad_out[9]}] [get_ports {pad_out[8]}] [get_ports {pad_out[7]}] [get_ports {pad_out[6]}] [get_ports {pad_out[5]}] [get_ports {pad_out[4]}] [get_ports {pad_out[3]}] [get_ports {pad_out[2]}] [get_ports {pad_out[1]}] [get_ports {pad_out[0]}] [get_ports pad_en] [get_ports ppar_out] [get_ports ppar_en] [get_ports {pc_be_out[3]}] [get_ports {pc_be_out[2]}] [get_ports {pc_be_out[1]}] [get_ports {pc_be_out[0]}] [get_ports pc_be_en] [get_ports pframe_n_out] [get_ports pframe_n_en] [get_ports ptrdy_n_out] [get_ports ptrdy_n_en] [get_ports pirdy_n_out] [get_ports pirdy_n_en] [get_ports pdevsel_n_out] [get_ports pdevsel_n_en] [get_ports pstop_n_out] [get_ports pstop_n_en] [get_ports pperr_n_out] [get_ports pperr_n_en] [get_ports pserr_n_out] [get_ports pserr_n_en] [get_ports preq_n] [get_ports {sd_A[9]}] [get_ports {sd_A[8]}] [get_ports {sd_A[7]}] [get_ports {sd_A[6]}] [get_ports {sd_A[5]}] [get_ports {sd_A[4]}] [get_ports {sd_A[3]}] [get_ports {sd_A[2]}] [get_ports {sd_A[1]}] [get_ports {sd_A[0]}] [get_ports sd_CK] [get_ports sd_CKn] [get_ports sd_LD] [get_ports sd_RW] [get_ports {sd_BWS[1]}] [get_ports {sd_BWS[0]}] [get_ports {sd_DQ_out[15]}] [get_ports {sd_DQ_out[14]}] [get_ports {sd_DQ_out[13]}] [get_ports {sd_DQ_out[12]}] [get_ports {sd_DQ_out[11]}] [get_ports {sd_DQ_out[10]}] [get_ports {sd_DQ_out[9]}] [get_ports {sd_DQ_out[8]}] [get_ports {sd_DQ_out[7]}] [get_ports {sd_DQ_out[6]}] [get_ports {sd_DQ_out[5]}] [get_ports {sd_DQ_out[4]}] [get_ports {sd_DQ_out[3]}] [get_ports {sd_DQ_out[2]}] [get_ports {sd_DQ_out[1]}] [get_ports {sd_DQ_out[0]}] [get_ports {sd_DQ_en[15]}] [get_ports {sd_DQ_en[14]}] [get_ports {sd_DQ_en[13]}] [get_ports {sd_DQ_en[12]}] [get_ports {sd_DQ_en[11]}] [get_ports {sd_DQ_en[10]}] [get_ports {sd_DQ_en[9]}] [get_ports {sd_DQ_en[8]}] [get_ports {sd_DQ_en[7]}] [get_ports {sd_DQ_en[6]}] [get_ports {sd_DQ_en[5]}] [get_ports {sd_DQ_en[4]}] [get_ports {sd_DQ_en[3]}] [get_ports {sd_DQ_en[2]}] [get_ports {sd_DQ_en[1]}] [get_ports {sd_DQ_en[0]}]]
group_path -name REGIN  -from [list [get_ports sys_clk] [get_ports sys_2x_clk] [get_ports sdram_clk] [get_ports scan_en] [get_ports test_mode] [get_ports pci_rst_n] [get_ports sdram_rst_n] [get_ports sys_rst_n] [get_ports sys_2x_rst_n] [get_ports pclk] [get_ports pidsel] [get_ports pgnt_n] [get_ports {pad_in[15]}] [get_ports {pad_in[14]}] [get_ports {pad_in[13]}] [get_ports {pad_in[12]}] [get_ports {pad_in[11]}] [get_ports {pad_in[10]}] [get_ports {pad_in[9]}] [get_ports {pad_in[8]}] [get_ports {pad_in[7]}] [get_ports {pad_in[6]}] [get_ports {pad_in[5]}] [get_ports {pad_in[4]}] [get_ports {pad_in[3]}] [get_ports {pad_in[2]}] [get_ports {pad_in[1]}] [get_ports {pad_in[0]}] [get_ports ppar_in] [get_ports {pc_be_in[3]}] [get_ports {pc_be_in[2]}] [get_ports {pc_be_in[1]}] [get_ports {pc_be_in[0]}] [get_ports pframe_n_in] [get_ports ptrdy_n_in] [get_ports pirdy_n_in] [get_ports pdevsel_n_in] [get_ports pstop_n_in] [get_ports pperr_n_in] [get_ports pserr_n_in] [get_ports pm66en] [get_ports {sd_DQ_in[15]}] [get_ports {sd_DQ_in[14]}] [get_ports {sd_DQ_in[13]}] [get_ports {sd_DQ_in[12]}] [get_ports {sd_DQ_in[11]}] [get_ports {sd_DQ_in[10]}] [get_ports {sd_DQ_in[9]}] [get_ports {sd_DQ_in[8]}] [get_ports {sd_DQ_in[7]}] [get_ports {sd_DQ_in[6]}] [get_ports {sd_DQ_in[5]}] [get_ports {sd_DQ_in[4]}] [get_ports {sd_DQ_in[3]}] [get_ports {sd_DQ_in[2]}] [get_ports {sd_DQ_in[1]}] [get_ports {sd_DQ_in[0]}]]
group_path -name REGOUT  -to [list [get_ports {pad_out[15]}] [get_ports {pad_out[14]}] [get_ports {pad_out[13]}] [get_ports {pad_out[12]}] [get_ports {pad_out[11]}] [get_ports {pad_out[10]}] [get_ports {pad_out[9]}] [get_ports {pad_out[8]}] [get_ports {pad_out[7]}] [get_ports {pad_out[6]}] [get_ports {pad_out[5]}] [get_ports {pad_out[4]}] [get_ports {pad_out[3]}] [get_ports {pad_out[2]}] [get_ports {pad_out[1]}] [get_ports {pad_out[0]}] [get_ports pad_en] [get_ports ppar_out] [get_ports ppar_en] [get_ports {pc_be_out[3]}] [get_ports {pc_be_out[2]}] [get_ports {pc_be_out[1]}] [get_ports {pc_be_out[0]}] [get_ports pc_be_en] [get_ports pframe_n_out] [get_ports pframe_n_en] [get_ports ptrdy_n_out] [get_ports ptrdy_n_en] [get_ports pirdy_n_out] [get_ports pirdy_n_en] [get_ports pdevsel_n_out] [get_ports pdevsel_n_en] [get_ports pstop_n_out] [get_ports pstop_n_en] [get_ports pperr_n_out] [get_ports pperr_n_en] [get_ports pserr_n_out] [get_ports pserr_n_en] [get_ports preq_n] [get_ports {sd_A[9]}] [get_ports {sd_A[8]}] [get_ports {sd_A[7]}] [get_ports {sd_A[6]}] [get_ports {sd_A[5]}] [get_ports {sd_A[4]}] [get_ports {sd_A[3]}] [get_ports {sd_A[2]}] [get_ports {sd_A[1]}] [get_ports {sd_A[0]}] [get_ports sd_CK] [get_ports sd_CKn] [get_ports sd_LD] [get_ports sd_RW] [get_ports {sd_BWS[1]}] [get_ports {sd_BWS[0]}] [get_ports {sd_DQ_out[15]}] [get_ports {sd_DQ_out[14]}] [get_ports {sd_DQ_out[13]}] [get_ports {sd_DQ_out[12]}] [get_ports {sd_DQ_out[11]}] [get_ports {sd_DQ_out[10]}] [get_ports {sd_DQ_out[9]}] [get_ports {sd_DQ_out[8]}] [get_ports {sd_DQ_out[7]}] [get_ports {sd_DQ_out[6]}] [get_ports {sd_DQ_out[5]}] [get_ports {sd_DQ_out[4]}] [get_ports {sd_DQ_out[3]}] [get_ports {sd_DQ_out[2]}] [get_ports {sd_DQ_out[1]}] [get_ports {sd_DQ_out[0]}] [get_ports {sd_DQ_en[15]}] [get_ports {sd_DQ_en[14]}] [get_ports {sd_DQ_en[13]}] [get_ports {sd_DQ_en[12]}] [get_ports {sd_DQ_en[11]}] [get_ports {sd_DQ_en[10]}] [get_ports {sd_DQ_en[9]}] [get_ports {sd_DQ_en[8]}] [get_ports {sd_DQ_en[7]}] [get_ports {sd_DQ_en[6]}] [get_ports {sd_DQ_en[5]}] [get_ports {sd_DQ_en[4]}] [get_ports {sd_DQ_en[3]}] [get_ports {sd_DQ_en[2]}] [get_ports {sd_DQ_en[1]}] [get_ports {sd_DQ_en[0]}]]
#set_clock_gating_check -rise -setup 0 [get_cells I_CONTEXT_MEM_clk_gate_ram_read_addr_reg/latch]
#set_clock_gating_check -fall -setup 0 [get_cells I_CONTEXT_MEM_clk_gate_ram_read_addr_reg/latch]
#set_clock_gating_check -rise -hold 0 [get_cells I_CONTEXT_MEM_clk_gate_ram_read_addr_reg/latch]
#set_clock_gating_check -fall -hold 0 [get_cells I_CONTEXT_MEM_clk_gate_ram_read_addr_reg/latch]
#set_clock_gating_check -rise -setup 0 [get_cells I_CONTEXT_MEM_clk_gate_ram_write_addr_reg/latch]
#set_clock_gating_check -fall -setup 0 [get_cells I_CONTEXT_MEM_clk_gate_ram_write_addr_reg/latch]
#set_clock_gating_check -rise -hold 0 [get_cells I_CONTEXT_MEM_clk_gate_ram_write_addr_reg/latch]
#set_clock_gating_check -fall -hold 0 [get_cells I_CONTEXT_MEM_clk_gate_ram_write_addr_reg/latch]
